{
  "backend/main.mo": "Main actor defining all backend types (Message, Worker, Material, CareerApplication, ArchitectProject, ContactRequest, UserProfile) and CRUD operations with admin authorization checks, including mixins for authorization and blob storage.",
  "backend/migration.mo": "Migration module defining OldActor and NewActor types with identical structure for state preservation during canister upgrades, with a pass-through run function.",
  "feature_evidence.json": "Feature evidence report documenting four implemented features: material sale message broadcasting, admin dashboard message display, main dashboard activity feed, and admin summary cards with real-time counts.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend files including routing, i18n, storage, validation, UI components, and pages with details on functionality and recent changes.",
  "frontend/index.css": "Global CSS with Tailwind directives and OKLCH color system defining light/dark theme variables for Work24 brand (off-white, orange, green) and admin dashboard (blue-gray tones).",
  "frontend/index.html": "HTML entry point with root div and module script loading main.tsx.",
  "frontend/src/App.tsx": "Root application component with TanStack Router setup defining all routes (home, services, materials, career, architect, submissions, contact, admin) with onboarding check and I18nProvider wrapper.",
  "frontend/src/components/activity/ActivityFeed.tsx": "Activity feed component displaying the 10 most recent messages from getAllMessages query with loading and empty states, sorted by timestamp descending.",
  "frontend/src/components/admin/AdminDashboardLayout.tsx": "Layout component for the admin dashboard with a collapsible sidebar navigation (desktop/mobile) that switches between overview, messages, materials, and workers sections.",
  "frontend/src/components/admin/AdminMessageRenderer.tsx": "Renders admin messages with JSON parsing, categorizes structured fields (customer info, requirements, etc.), displays source badges, and provides a toggle to view raw message content.",
  "frontend/src/components/admin/AdminSummaryCards.tsx": "Displays four summary cards showing total counts for messages, workers, materials, and overall activity with color-coded icons.",
  "frontend/src/components/admin/MaterialsTab.tsx": "Admin tab displaying a table of all materials with columns for ID, name, category, location, and description, plus a refresh button.",
  "frontend/src/components/admin/MessagesTab.tsx": "Admin tab showing all messages in a table with delete functionality, confirmation dialog, and uses AdminMessageRenderer to display message content.",
  "frontend/src/components/admin/WorkersTab.tsx": "Admin tab displaying a table of all workers with columns for ID, name, skill, category, and location, plus a refresh button.",
  "frontend/src/components/common/Work24Card.tsx": "Reusable card wrapper component with hover effects (shadow, scale) and optional click handler.",
  "frontend/src/components/common/Work24FormField.tsx": "Form field wrapper component that displays a label, optional required indicator, helper text, and error messages.",
  "frontend/src/components/contact/ContactViaWork24Dialog.tsx": "Dialog component for submitting contact requests with form validation for customer name, mobile number, and requirements. Handles submission via mutation hook and displays success/error toasts.",
  "frontend/src/components/contact/Work24OfficialContactPanel.tsx": "Dialog component displaying Work24's official contact information (phone and email) with internationalization support. Shows contact details in a formatted panel with icons.",
  "frontend/src/components/layout/AppFooter.tsx": "Footer component displaying contact information, service description, quick navigation links, copyright notice, and attribution to caffeine.ai. Organized in a three-column grid layout.",
  "frontend/src/components/layout/AppHeader.tsx": "Header component with logo, desktop/mobile navigation menus, language switcher, and conditional admin link. Uses Sheet component for mobile menu drawer.",
  "frontend/src/components/layout/AppShell.tsx": "Layout wrapper component that combines AppHeader, main content area, and AppFooter in a flex column layout. Provides consistent page structure across the application.",
  "frontend/src/components/materials/MaterialCard.tsx": "Card component displaying material details (image, name, category, location, description) with a contact button that opens ContactViaWork24Dialog. Includes hover effects and responsive layout.",
  "frontend/src/components/settings/LanguageSwitcher.tsx": "Dropdown menu component for switching between English, Hindi, and Gujarati languages. Uses Globe icon and displays current language with i18n context integration.",
  "frontend/src/components/workers/WorkerCard.tsx": "Card component displaying worker profile with image, name, skill, location, and work gallery. Opens ContactViaWork24Dialog for contact and a separate dialog to view work images.",
  "frontend/src/hooks/useActor.ts": "React Query hook managing backend actor creation with Internet Identity authentication. Handles anonymous and authenticated actors, initializes access control, and invalidates dependent queries on identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context provider and hook for Internet Identity authentication managing login state, identity persistence, and AuthClient lifecycle. Provides login, logout, and status tracking functionality with configurable options.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating backend data including admin messages, all messages, workers by category, materials, and operations to add/delete workers and materials with automatic query invalidation.",
  "frontend/src/i18n/I18nProvider.tsx": "Provides internationalization context with language switching (English, Hindi, Gujarati), translation function with nested key support and English fallback, and persists language preference to local storage.",
  "frontend/src/i18n/translations.ts": "Contains translation dictionaries for English, Hindi, and Gujarati covering navigation, onboarding, services, forms, admin UI, and validation messages with nested key structure.",
  "frontend/src/index.css": "Defines Tailwind CSS configuration with custom CSS variables for light/dark mode theming including Work24 brand colors and separate admin dashboard color schemes using OKLCH color space.",
  "frontend/src/lib/adminAllowlist.ts": "Deprecated module previously used for principal-based admin authorization; now replaced by username/password authentication via adminSession.ts.",
  "frontend/src/lib/adminMessageFormatting.ts": "Provides utilities for parsing JSON messages, categorizing recognized fields (name, mobile, requirement, etc.), formatting values for display, and extracting message source/origin with i18n support.",
  "frontend/src/lib/adminSession.ts": "Manages admin authentication state in sessionStorage with functions to set, get, clear, and check admin login status using adminId and password credentials.",
  "frontend/src/lib/contactSubmissions.ts": "Exports a React Query mutation hook for submitting contact requests (worker, material, career, architect) as JSON messages to the backend actor with automatic admin message query invalidation.",
  "frontend/src/lib/formatIcTime.ts": "Converts Internet Computer nanosecond timestamps (bigint) to human-readable date strings with localized formatting.",
  "frontend/src/lib/localPreferences.ts": "Manages localStorage for user preferences including onboarding status, user name, language selection, and unique submitter ID generation.",
  "frontend/src/lib/materialsStorage.ts": "Provides localStorage-based functions to get and add materials with auto-generated IDs (appears to be legacy/unused given backend integration).",
  "frontend/src/lib/officialContact.ts": "Exports Work24's official contact phone number and email with formatted display strings and clickable links.",
  "frontend/src/lib/safety/noDirectContact.ts": "Defines allowed fields for worker and material data with sanitization functions to prevent exposure of sensitive contact information to frontend users.",
  "frontend/src/lib/servicesCatalog.ts": "Defines the service catalog with six categories (furniture, painting, fabrication, plumbing, electrical, custom) including i18n keys and emoji icons.",
  "frontend/src/lib/validation.ts": "Provides validation functions for required fields and Indian mobile numbers (10 digits starting with 6-9) with i18n error messages.",
  "frontend/src/lib/workersStorage.ts": "Provides localStorage-based functions to get, filter by service, and add workers with auto-generated IDs.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query, Internet Identity provider, and renders the root App component.",
  "frontend/src/pages/Admin.tsx": "Admin page with login form and dashboard sections (overview, messages, materials, workers) protected by session-based authentication.",
  "frontend/src/pages/Architect.tsx": "Form page for architects to submit project details including name, type, location, budget, message, and file uploads.",
  "frontend/src/pages/Career.tsx": "Career application form collecting name, mobile, skills, experience, and optional message with validation.",
  "frontend/src/pages/ContactUs.tsx": "Static contact page displaying official phone and email information with service description.",
  "frontend/src/pages/HomeServices.tsx": "Landing page with hero section, activity feed, and grid of service categories linking to worker listings.",
  "frontend/src/pages/Materials.tsx": "Page displaying a grid of construction materials for sale fetched via useGetAllMaterials query.",
  "frontend/src/pages/Onboarding.tsx": "First-time user onboarding flow collecting name and language preference, storing to local preferences before redirecting home.",
  "frontend/src/pages/SellerMaterialSubmission.tsx": "Form component for sellers to submit construction materials for sale, including name, category, description, location, and images with validation and mutation handling.",
  "frontend/src/pages/ServiceDetail.tsx": "Service detail page that displays available workers for a specific service category, fetched by serviceId from URL params.",
  "frontend/src/pages/WorkerSubmission.tsx": "Registration form for workers to submit their profile including name, skill, category, location, profile image, and work portfolio images with validation.",
  "frontend/src/types/materials.ts": "TypeScript interface defining the Material type with properties for id, name, category, description, images, location, and submitter information.",
  "frontend/src/types/workers.ts": "TypeScript interface defining the Worker type with properties for id, name, skill, service category, images, location, and submitter information.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, storing, and managing URL parameters and session storage, supporting both hash-based and browser-based routing.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom theme colors (including admin theme), container settings, border radius, shadows, and animations for the application.",
  "project_state.json": "Project state tracking document identifying issues with real-time activity notifications not appearing in main and admin dashboards for material sales, worker registrations, and messages."
}