{
  "backend/main.mo": "Main actor defining types (Message, Worker, Material, CareerApplication, ArchitectProject, ContactRequest, UserProfile) and CRUD functions with admin-only access control for messages, workers, materials, career applications, architect projects, and contact requests; includes authorization and blob storage mixins.",
  "backend/migration.mo": "Migration module defining OldActor and NewActor types and a run function that preserves existing messages/userProfiles while initializing empty maps for workers, materials, careerApplications, architectProjects, and contactRequests with their respective ID counters.",
  "feature_evidence.json": "Feature evidence report documenting seven implemented features (worker marketplace, multi-language support, worker submission, material submission, admin dashboard, career form, architect project form) with associated files, components, test IDs, and confidence levels.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend files including routing, i18n, storage layers, validation, UI components, and page components with details on functionality and recent changes.",
  "frontend/index.css": "Global Tailwind CSS styles with OKLCH color system defining light and dark mode CSS variables for Work24 brand colors (off-white base, orange primary, green accent) and component tokens.",
  "frontend/index.html": "HTML entry point with root div and module script loading main.tsx.",
  "frontend/src/App.tsx": "Main app component with TanStack Router setup defining nine routes (home, service detail, materials, career, architect, worker/material submissions, contact, admin) wrapped in I18nProvider with onboarding check and AppShell layout.",
  "frontend/src/components/admin/AdminMessageRenderer.tsx": "Component that parses and renders admin messages with formatted/raw JSON toggle, categorizes fields into recognized and other, displays source badges, and formats values with localized labels.",
  "frontend/src/components/admin/MaterialsTab.tsx": "Admin tab component that displays a table of all submitted materials with refresh functionality, showing ID, name, category, location, and description.",
  "frontend/src/components/admin/MessagesTab.tsx": "Admin tab component for viewing and managing contact form submissions with delete functionality, displaying message ID, timestamp, text, and action buttons with confirmation dialog.",
  "frontend/src/components/admin/WorkersTab.tsx": "Admin tab component that displays a table of all registered worker profiles with refresh functionality, showing ID, name, skill, category, and location.",
  "frontend/src/components/common/Work24Card.tsx": "Reusable card wrapper component with hover effects and optional click handling, providing consistent styling across the application.",
  "frontend/src/components/common/Work24FormField.tsx": "Form field wrapper component that provides consistent label, error message, helper text, and required indicator styling for form inputs.",
  "frontend/src/components/contact/ContactViaWork24Dialog.tsx": "Dialog component for submitting contact requests about workers or materials, collecting customer name, mobile number, and requirements with validation.",
  "frontend/src/components/contact/Work24OfficialContactPanel.tsx": "Dialog component displaying official Work24 contact information including phone number and email with clickable links.",
  "frontend/src/components/layout/AppFooter.tsx": "Application footer component with contact information, service description, quick navigation links, copyright notice, and caffeine.ai attribution.",
  "frontend/src/components/layout/AppHeader.tsx": "Application header with logo, desktop/mobile navigation menus, language switcher, and conditional admin link based on login status.",
  "frontend/src/components/layout/AppShell.tsx": "Main layout wrapper component that combines AppHeader, main content area, and AppFooter in a flex column layout.",
  "frontend/src/components/materials/MaterialCard.tsx": "Card component for displaying material listings with image, details (name, category, location, description), and a contact button that opens the contact dialog.",
  "frontend/src/components/settings/LanguageSwitcher.tsx": "A dropdown menu component that allows users to switch between English, Hindi, and Gujarati languages using the i18n context.",
  "frontend/src/components/workers/WorkerCard.tsx": "Displays a worker profile card with image, name, skill, location, and buttons to view work gallery and open a contact dialog.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages the backend actor instance based on Internet Identity authentication state, initializing access control with an admin token.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context and hooks for login/logout functionality with AuthClient integration and delegation identity management.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating backend data including workers, materials, messages, and contact requests using the actor instance.",
  "frontend/src/i18n/I18nProvider.tsx": "React context provider for internationalization that manages language state, persists preferences, and provides translation function to child components.",
  "frontend/src/i18n/translations.ts": "Contains translation strings for English, Hindi, and Gujarati languages covering navigation, services, forms, and UI text across the application.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables defining color schemes for light and dark modes using an orange/green palette with off-white backgrounds.",
  "frontend/src/lib/adminAllowlist.ts": "Deprecated module for principal-based admin authorization, replaced by username/password authentication via adminSession.ts.",
  "frontend/src/lib/adminMessageFormatting.ts": "Provides helper functions for parsing and formatting admin messages, including safe JSON parsing, field categorization (recognized vs. other), value formatting, and extracting message source/origin.",
  "frontend/src/lib/adminSession.ts": "Manages admin authentication state using sessionStorage, providing functions to set, get, clear, and check admin session credentials.",
  "frontend/src/lib/contactSubmissions.ts": "Defines ContactSubmission interface and provides a React Query mutation hook to submit contact forms (worker, material, career, architect) to the backend actor.",
  "frontend/src/lib/formatIcTime.ts": "Converts Internet Computer bigint timestamps (nanoseconds) to human-readable date strings using locale formatting.",
  "frontend/src/lib/localPreferences.ts": "Manages user preferences in localStorage including onboarding status, user name, language selection, and unique submitter ID generation.",
  "frontend/src/lib/materialsStorage.ts": "Handles localStorage operations for materials data, providing functions to get all materials and add new materials with generated IDs.",
  "frontend/src/lib/officialContact.ts": "Exports official Work24 contact information constants including phone number, email, and formatted display/link strings.",
  "frontend/src/lib/safety/noDirectContact.ts": "Defines allowed fields for worker and material data and provides sanitization functions to prevent exposure of sensitive contact information.",
  "frontend/src/lib/servicesCatalog.ts": "Defines the services catalog with IDs, translation keys, and icons for furniture, painting, fabrication, plumbing, electrical, and custom services.",
  "frontend/src/lib/validation.ts": "Provides validation functions for required fields and Indian mobile numbers (10 digits starting with 6-9) with internationalized error messages.",
  "frontend/src/lib/workersStorage.ts": "Handles localStorage operations for worker profiles, providing functions to get all workers, filter by service category, and add new workers with generated IDs.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query, Internet Identity provider, and renders the root App component.",
  "frontend/src/pages/Admin.tsx": "Admin dashboard page with login authentication (hardcoded credentials), logout functionality, and tabs for managing messages, materials, and workers.",
  "frontend/src/pages/Architect.tsx": "Architect project submission form page that collects project details (name, type, location, budget, message) and file uploads, submitting to backend via mutation hook.",
  "frontend/src/pages/Career.tsx": "Career application form page that collects applicant information (name, mobile, skills, experience, message) with validation and submits via mutation hook.",
  "frontend/src/pages/ContactUs.tsx": "Contact page displaying Work24's official phone and email information with sections for contact details and service description.",
  "frontend/src/pages/HomeServices.tsx": "Home page with hero section and service catalog grid, allowing users to browse and navigate to different service categories.",
  "frontend/src/pages/Materials.tsx": "Materials marketplace page that fetches and displays all available construction materials in a grid layout using MaterialCard components.",
  "frontend/src/pages/Onboarding.tsx": "Initial onboarding flow that collects user name and language preference, then saves to local storage and redirects to home.",
  "frontend/src/pages/SellerMaterialSubmission.tsx": "Form page for sellers to submit construction materials for sale with name, category, description, location, and image uploads.",
  "frontend/src/pages/ServiceDetail.tsx": "Service category detail page that displays all workers available for a specific service category with back navigation.",
  "frontend/src/pages/WorkerSubmission.tsx": "Registration form for workers to submit their profile including name, skill, category, location, profile image, and work portfolio images.",
  "frontend/src/types/materials.ts": "TypeScript interface defining the Material type with id, name, category, description, images, location, and submitter information.",
  "frontend/src/types/workers.ts": "TypeScript interface defining the Worker type with id, name, skill, service category, profile/work images, location, and submitter information.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, storing, and managing URL parameters and session storage, supporting both regular and hash-based routing.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration file defining custom color scheme using OKLCH color space with CSS variables, extended theme with custom shadows, border radii, accordion animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state file tracking 10 implemented features for a worker marketplace platform including multi-language support, worker/material seller submission forms, admin dashboard, contact flows, and onboarding functionality."
}