{
  "backend/main.mo": "Main Motoko actor defining all data types (Message, Worker, Material, CareerApplication, ArchitectProject, ContactRequest, UserProfile) and CRUD operations with admin authorization checks, including mixins for authorization and blob storage.",
  "backend/migration.mo": "Migration module that handles state upgrades by extracting nextMessageId from old state and dropping deprecated ADMIN_USERNAME/ADMIN_PASSWORD fields.",
  "feature_evidence.json": "Feature evidence report documenting two requirements: removing ActivityFeed from HomeServices.tsx and modifying admin MessagesTab to display all activity messages with proper parsing.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend files including routing, i18n, storage layers, validation, components, and UI elements with focus on admin dashboard and activity tracking.",
  "frontend/index.css": "Global CSS with Tailwind layers defining OKLCH color system for Work24 brand (off-white, orange primary) and admin dashboard theme (blue-gray) for both light and dark modes.",
  "frontend/index.html": "HTML entry point with root div and module script loading main.tsx.",
  "frontend/src/App.tsx": "Main app component with TanStack Router setup defining all routes (home, services, materials, career, architect, submissions, contact, admin) with I18nProvider wrapper and onboarding check.",
  "frontend/src/components/activity/ActivityFeed.tsx": "Component that fetches and displays the 10 most recent activity messages sorted by timestamp, using ActivityMessageRenderer for structured rendering with loading and empty states.",
  "frontend/src/components/activity/ActivityMessageRenderer.tsx": "Parses JSON-formatted activity messages to extract source/origin, generates human-readable summaries for different message types (career, architect, worker, material, contact), and displays with badges and formatted text.",
  "frontend/src/components/admin/AdminDashboardLayout.tsx": "Admin dashboard layout component with responsive sidebar navigation (overview, messages, materials, workers sections) and mobile menu support using Sheet component.",
  "frontend/src/components/admin/AdminMessageRenderer.tsx": "Renders admin messages with JSON parsing, categorizes structured fields (customer info, requirements, etc.), displays source badges, and provides toggle between formatted and raw JSON views.",
  "frontend/src/components/admin/AdminSummaryCards.tsx": "Displays four summary cards showing total counts for messages, workers, materials, and overall activity with icons and loading states.",
  "frontend/src/components/admin/MaterialsTab.tsx": "Admin tab displaying materials in a table with columns for ID, name, category, location, and description, includes refresh functionality.",
  "frontend/src/components/admin/MessagesTab.tsx": "Admin tab showing messages sorted by timestamp (newest first) in a table with delete functionality and confirmation dialog, uses AdminMessageRenderer for message display.",
  "frontend/src/components/admin/WorkersTab.tsx": "Admin tab displaying workers in a table with columns for ID, name, skill, category, and location, includes refresh functionality.",
  "frontend/src/components/common/Work24Card.tsx": "Reusable card wrapper component with hover effects (shadow and scale) and optional click handler.",
  "frontend/src/components/common/Work24FormField.tsx": "Form field wrapper component that displays label, children input, optional required indicator, helper text, and error messages.",
  "frontend/src/components/contact/ContactViaWork24Dialog.tsx": "A dialog component for submitting contact requests about workers or materials, with form validation for customer name, mobile number, and requirements fields.",
  "frontend/src/components/contact/Work24OfficialContactPanel.tsx": "A dialog panel displaying Work24's official contact information (phone and email) with internationalization support.",
  "frontend/src/components/layout/AppFooter.tsx": "Footer component displaying contact information, service description, quick navigation links, copyright notice, and a caffeine.ai attribution.",
  "frontend/src/components/layout/AppHeader.tsx": "Header component with logo, desktop/mobile navigation menus, language switcher, and conditional admin link based on login status.",
  "frontend/src/components/layout/AppShell.tsx": "Layout wrapper component that combines AppHeader, main content area, and AppFooter in a flex column structure.",
  "frontend/src/components/materials/MaterialCard.tsx": "Card component displaying material details (image, name, category, location, description) with a button to open the contact dialog.",
  "frontend/src/components/settings/LanguageSwitcher.tsx": "Dropdown menu component for switching between English, Hindi, and Gujarati languages using the i18n context.",
  "frontend/src/components/workers/WorkerCard.tsx": "Card component displaying worker profile with image, skill, location, optional work gallery dialog, and contact button.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages the backend actor with authentication, handling both anonymous and authenticated states with admin token initialization.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context provider and hook for Internet Identity authentication, managing login state, identity persistence, and AuthClient lifecycle with configurable options.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating backend data including admin messages, all messages, workers (by category), materials, and operations to add/delete workers and materials with automatic cache invalidation.",
  "frontend/src/i18n/I18nProvider.tsx": "Provides internationalization context with language switching (en/hi/gu), translation function with nested key support and English fallback, and persists language preference to local storage.",
  "frontend/src/i18n/translations.ts": "Defines translation keys and values for English, Hindi, and Gujarati languages covering navigation, onboarding, services, forms, and all UI text across the application.",
  "frontend/src/index.css": "Defines Tailwind CSS configuration with custom CSS variables for light/dark mode theming including Work24 brand colors and separate admin dashboard color schemes using OKLCH color space.",
  "frontend/src/lib/adminAllowlist.ts": "Deprecated module previously used for principal-based admin access control; now replaced by username/password authentication via adminSession.ts.",
  "frontend/src/lib/adminMessageFormatting.ts": "Provides utilities for parsing JSON messages, categorizing recognized fields, formatting values for display, and extracting human-readable message sources with translation support.",
  "frontend/src/lib/adminSession.ts": "Manages admin authentication session state in sessionStorage with functions to set, get, clear, and check admin login status using adminId and password credentials.",
  "frontend/src/lib/contactSubmissions.ts": "Defines contact submission interface and React Query mutation hook for submitting worker/material/career/architect contact requests as JSON messages to the backend actor.",
  "frontend/src/lib/formatIcTime.ts": "Converts Internet Computer nanosecond timestamps (bigint) to human-readable date strings formatted with locale-specific options.",
  "frontend/src/lib/localPreferences.ts": "Manages localStorage for user preferences including onboarding status, user name, language selection, and unique submitter ID generation and retrieval.",
  "frontend/src/lib/materialsStorage.ts": "Provides localStorage-based functions to get and add materials with auto-generated IDs (appears to be legacy code, likely superseded by backend storage).",
  "frontend/src/lib/officialContact.ts": "Exports official Work24 contact information constants including phone number, email, and formatted display/link strings.",
  "frontend/src/lib/safety/noDirectContact.ts": "Defines allowed fields for worker and material data exposure and provides sanitization functions to prevent leaking sensitive contact information to frontend.",
  "frontend/src/lib/servicesCatalog.ts": "Defines the service catalog with six service types (furniture, painting, fabrication, plumbing, electrical, custom) including translation keys and emoji icons.",
  "frontend/src/lib/validation.ts": "Provides validation functions for required fields and Indian mobile numbers (10 digits starting with 6-9) with internationalized error messages.",
  "frontend/src/lib/workersStorage.ts": "Provides localStorage-based functions to get, filter by service, and add workers with auto-generated IDs.",
  "frontend/src/main.tsx": "Application entry point that renders the root component wrapped in QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/Admin.tsx": "Admin dashboard page with login authentication, session management, and tabs for overview, messages, materials, and workers.",
  "frontend/src/pages/Architect.tsx": "Form page for architects to submit project details including name, type, location, budget, message, and file uploads.",
  "frontend/src/pages/Career.tsx": "Career application form for workers to submit name, mobile, skills, experience, and message with validation.",
  "frontend/src/pages/ContactUs.tsx": "Static contact page displaying official phone and email information with service description.",
  "frontend/src/pages/HomeServices.tsx": "Landing page with hero section and grid of service categories that navigate to individual service detail pages.",
  "frontend/src/pages/Materials.tsx": "Page displaying a grid of construction materials for sale fetched from backend with loading and empty states.",
  "frontend/src/pages/Onboarding.tsx": "First-time user onboarding form to collect name and language preference, storing results in local preferences.",
  "frontend/src/pages/SellerMaterialSubmission.tsx": "Form page for sellers to submit construction materials for sale, including name, category, description, location, and images with validation and mutation hooks.",
  "frontend/src/pages/ServiceDetail.tsx": "Service detail page that displays available workers for a specific service category, fetched by category ID with navigation back to home.",
  "frontend/src/pages/WorkerSubmission.tsx": "Registration form for workers to submit their profile including name, skill, category, location, profile image, and work portfolio images with validation.",
  "frontend/src/types/materials.ts": "TypeScript interface defining the Material type with id, name, category, description, images array, location, and submitter information.",
  "frontend/src/types/workers.ts": "TypeScript interface defining the Worker type with id, name, skill, service category, profile/work images, location, and submitter information.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, storing, and managing URL parameters from both query strings and hash-based routing, with sessionStorage persistence support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom theme extensions for colors (including admin theme), border radius, shadows, animations, and plugins for animate and typography.",
  "project_state.json": "Project state tracking document indicating the current issue is fixing the admin dashboard to display all user activities (worker registrations, material listings, requirements) that are currently not showing."
}