{
  "backend/main.mo": "Main backend canister implementing message storage, admin CRUD for messages, and user profile management with access control.",
  "backend/migration.mo": "Migration script converting old list-based messages into a map with IDs for the updated backend format.",
  "feature_evidence.json": "Feature evidence report mapping recent admin and i18n features to affected frontend files and components.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of all frontend files across the project.",
  "frontend/index.css": "Tailwind base layer defining OKLCH theme tokens for light and dark modes with global styling.",
  "frontend/index.html": "HTML entry point containing the root div and loading the main React script.",
  "frontend/src/App.tsx": "Sets up TanStack Router routes and wraps the app with the I18n provider and AppShell layout.",
  "frontend/src/components/common/Work24Card.tsx": "Reusable card wrapper component with hover animation and optional click handling.",
  "frontend/src/components/common/Work24FormField.tsx": "Reusable form field component handling label, helper text, and error display.",
  "frontend/src/components/contact/ContactViaWork24Dialog.tsx": "Dialog component allowing users to submit contact requests for workers with validation and backend submission.",
  "frontend/src/components/contact/Work24OfficialContactPanel.tsx": "Dialog component showing official phone and email contacts using i18n and a close button.",
  "frontend/src/components/layout/AppFooter.tsx": "Footer with contact info, service description, quick links, and branding using i18n.",
  "frontend/src/components/layout/AppHeader.tsx": "Responsive header with navigation, logo, admin-aware links, and language switcher.",
  "frontend/src/components/layout/AppShell.tsx": "Layout wrapper that renders the header, footer, and page content.",
  "frontend/src/components/materials/MaterialCard.tsx": "Card displaying sanitized material info with image, details, and a contact button.",
  "frontend/src/components/settings/LanguageSwitcher.tsx": "Dropdown language selector updating the i18n context.",
  "frontend/src/components/workers/WorkerCard.tsx": "Card showing sanitized worker data, gallery dialog previews, and a contact button.",
  "frontend/src/hooks/useActor.ts": "React hook creating and managing an authenticated or anonymous backend actor with reactivity.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and hooks for managing Internet Identity login, state, and persistence.",
  "frontend/src/hooks/useQueries.ts": "React-query hooks for fetching and deleting admin messages using the actor API.",
  "frontend/src/i18n/I18nProvider.tsx": "i18n provider managing language state, translations, and HTML lang attribute.",
  "frontend/src/i18n/translations.ts": "Defines supported languages and a nested object containing all UI translation strings.",
  "frontend/src/index.css": "Configures Tailwind layers and theme variables for light and dark modes with global base styles.",
  "frontend/src/lib/adminAllowlist.ts": "Deprecated helper for admin allowlist checks, replaced by session-based authentication.",
  "frontend/src/lib/adminSession.ts": "Manages admin login state using sessionStorage, including storing, retrieving, and clearing credentials.",
  "frontend/src/lib/contactSubmissions.ts": "Provides a React Query mutation for sending contact submissions through the actor and invalidating admin message queries.",
  "frontend/src/lib/formatIcTime.ts": "Converts IC nanosecond timestamps into human‑readable locale strings.",
  "frontend/src/lib/localPreferences.ts": "Handles onboarding, username, and language preferences via localStorage.",
  "frontend/src/lib/materialsStorage.ts": "Manages material entries in localStorage, including retrieval and creation with generated IDs.",
  "frontend/src/lib/officialContact.ts": "Exports official Work24 phone and email constants and corresponding clickable links.",
  "frontend/src/lib/safety/noDirectContact.ts": "Sanitizes worker and material objects by whitelisting allowed fields to prevent exposure of sensitive data.",
  "frontend/src/lib/servicesCatalog.ts": "Defines the list of service categories with IDs, translation keys, and icons, plus a lookup helper.",
  "frontend/src/lib/validation.ts": "Provides simple required-field and mobile-number validators using translation keys for errors.",
  "frontend/src/lib/workersStorage.ts": "Stores and retrieves worker records in localStorage, including adding workers with generated IDs and filtering by service.",
  "frontend/src/main.tsx": "Initializes React root, wraps the app with Internet Identity and React Query providers, and loads global styles.",
  "frontend/src/pages/Admin.tsx": "Implements the admin login and message-management UI with credential checks, deletion dialogs, and data fetching.",
  "frontend/src/pages/Architect.tsx": "Implements the architect contact form with validation, file handling, and submission through the contact API.",
  "frontend/src/pages/Career.tsx": "Career form page collecting applicant details and submitting them via contact API with validation and success/error toasts.",
  "frontend/src/pages/ContactUs.tsx": "Displays official phone, email, and service info with icons and localized text.",
  "frontend/src/pages/HomeServices.tsx": "Home page showing hero content and a grid of service cards that navigate to service detail pages.",
  "frontend/src/pages/Materials.tsx": "Lists available materials or a fallback message and provides a contact panel for inquiries.",
  "frontend/src/pages/Onboarding.tsx": "User onboarding flow collecting name and language, saving preferences, and redirecting home.",
  "frontend/src/pages/SellerMaterialSubmission.tsx": "Form for sellers to submit materials with validation, image uploads, and storage via addMaterial.",
  "frontend/src/pages/ServiceDetail.tsx": "Shows service info and workers for a given service, with a dialog to contact a selected worker.",
  "frontend/src/pages/WorkerSubmission.tsx": "Worker signup form to upload profile and work images and create a worker entry with validation.",
  "frontend/src/types/materials.ts": "Defines the Material interface including id, metadata, and images.",
  "frontend/src/types/workers.ts": "Defines the Worker interface including id, skill, service category, and images.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading URL params, storing them in sessionStorage, and syncing URL and session values, including hash-based routing support.",
  "frontend/tailwind.config.js": "Configures Tailwind with dark mode, custom colors, extended theme settings, animations, and several plugins.",
  "project_state.json": "Defines the project’s state, including existing features, new feature requests, and metadata for the Work24 Admin Dashboard."
}