{
  "backend/main.mo": "Motoko canister managing public message submissions with admin-protected retrieval and deletion plus user profile storage with access control.",
  "feature_evidence.json": "Feature evidence report detailing admin message formatting, toggling, field extraction, and i18n updates with associated files and test IDs.",
  "frontend-file-summaries.txt": "List of frontend file summaries describing routing, components, styling, i18n, storage, and utility modules.",
  "frontend/index.css": "Tailwind base theme with custom OKLCH color variables for light and dark modes.",
  "frontend/index.html": "Basic HTML root document loading the React app entry point.",
  "frontend/src/App.tsx": "Main React routing setup defining all app routes and onboarding logic wrapped in AppShell and I18nProvider.",
  "frontend/src/components/admin/AdminMessageRenderer.tsx": "Admin UI component rendering message JSON with formatted and raw toggle, field categorization, and i18n labels.",
  "frontend/src/components/common/Work24Card.tsx": "Reusable styled card wrapper with optional click interaction.",
  "frontend/src/components/common/Work24FormField.tsx": "Reusable form field wrapper showing label, helper text, and error display.",
  "frontend/src/components/contact/ContactViaWork24Dialog.tsx": "Dialog form for contacting a worker via Work24 with validation and submission handling.",
  "frontend/src/components/contact/Work24OfficialContactPanel.tsx": "Dialog showing official Work24 phone and email contacts with a close button.",
  "frontend/src/components/layout/AppFooter.tsx": "Footer displaying contact details, service info, quick links, and attribution.",
  "frontend/src/components/layout/AppHeader.tsx": "Header with navigation links, language switcher, mobile menu, and optional admin link.",
  "frontend/src/components/layout/AppShell.tsx": "Layout wrapper rendering header, main content, and footer.",
  "frontend/src/components/materials/MaterialCard.tsx": "Card showing sanitized material details, image, description, and a contact button.",
  "frontend/src/components/settings/LanguageSwitcher.tsx": "Dropdown menu to switch the app's language using i18n context.",
  "frontend/src/components/workers/WorkerCard.tsx": "Card displaying sanitized worker info, gallery with image preview dialog, and contact button.",
  "frontend/src/hooks/useActor.ts": "Hook creating and managing an authenticated or anonymous backend actor and refreshing dependent queries.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and hooks for managing Internet Identity auth, login state, and stored identities.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for fetching and deleting admin messages via the actor and session data.",
  "frontend/src/i18n/I18nProvider.tsx": "Implements a context provider for language selection and translations, persisting language in local preferences.",
  "frontend/src/i18n/translations.ts": "Defines supported languages and nested translation strings for the app UI.",
  "frontend/src/index.css": "Configures Tailwind base styles, CSS variables for theming, and global typography settings.",
  "frontend/src/lib/adminAllowlist.ts": "Deprecated admin allowlist utilities replaced by the new session-based authentication model.",
  "frontend/src/lib/adminMessageFormatting.ts": "Utility functions for parsing, categorizing, and formatting admin message JSON fields.",
  "frontend/src/lib/adminSession.ts": "Manages admin login credentials using sessionStorage with helpers to set, get, and clear sessions.",
  "frontend/src/lib/contactSubmissions.ts": "Provides a mutation hook to submit contact requests by sending formatted messages to the backend.",
  "frontend/src/lib/formatIcTime.ts": "Converts IC bigint nanosecond timestamps into human‑readable date strings.",
  "frontend/src/lib/localPreferences.ts": "Handles onboarding, username, and language persistence using localStorage.",
  "frontend/src/lib/materialsStorage.ts": "Stores and retrieves materials from localStorage and generates IDs for new materials.",
  "frontend/src/lib/officialContact.ts": "Exports static official contact details and preformatted links for phone and email.",
  "frontend/src/lib/safety/noDirectContact.ts": "Sanitizes worker and material objects by whitelisting allowed safe fields.",
  "frontend/src/lib/servicesCatalog.ts": "Defines the list of service categories with IDs, translation keys, and icons.",
  "frontend/src/lib/validation.ts": "Provides basic form validation helpers for required fields and mobile numbers.",
  "frontend/src/lib/workersStorage.ts": "Handles worker storage in localStorage, including lookup by service and ID generation.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers.",
  "frontend/src/pages/Admin.tsx": "Admin page with login handling, message fetching, and delete actions using React Query and session storage.",
  "frontend/src/pages/Architect.tsx": "Architect inquiry form that validates inputs, handles file uploads, and submits project details.",
  "frontend/src/pages/Career.tsx": "Career application form collecting candidate info, validating fields, and sending submissions.",
  "frontend/src/pages/ContactUs.tsx": "Static contact page showing phone, email, service info, and localization support.",
  "frontend/src/pages/HomeServices.tsx": "Home page displaying hero content and a grid of navigable service cards.",
  "frontend/src/pages/Materials.tsx": "Materials listing page rendering stored materials and showing a contact panel.",
  "frontend/src/pages/Onboarding.tsx": "Onboarding flow to collect user name and language preference, storing it and navigating home.",
  "frontend/src/pages/SellerMaterialSubmission.tsx": "Form page allowing sellers to submit material info with validation, image upload, and storage via addMaterial.",
  "frontend/src/pages/ServiceDetail.tsx": "Displays details for a service and lists related workers, with a dialog for contacting a selected worker.",
  "frontend/src/pages/WorkerSubmission.tsx": "Form for workers to submit profiles including skills, images, and service category, validating inputs and storing via addWorker.",
  "frontend/src/types/materials.ts": "Defines the Material interface with id, metadata fields, and image list.",
  "frontend/src/types/workers.ts": "Defines the Worker interface including skill, service category, images, and optional location.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, persisting, and clearing URL parameters using query strings, hash routing, and sessionStorage.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme extensions, colors, animations, and plugins.",
  "project_state.json": "Project metadata describing existing and pending features for the Work24 Admin Dashboard."
}