{
  "backend/main.mo": "Main backend actor implementing message CRUD operations, user profiles, and role-based access control (admin/user permissions) using AccessControl and MixinAuthorization modules.",
  "feature_evidence.json": "Feature evidence report documenting five implemented features for worker/material attribution tracking and admin panel organization with associated files, components, and test IDs.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend source files including components, pages, hooks, utilities, and type definitions for the Work24 application.",
  "frontend/index.css": "Tailwind CSS configuration with OKLCH color system defining light and dark mode theme variables for the Work24 brand (off-white base, orange primary, green accent).",
  "frontend/index.html": "HTML entry point with root div and module script reference to main.tsx for the Work24 application.",
  "frontend/src/App.tsx": "Main app component with TanStack Router setup defining all routes (home, services, materials, career, architect, submissions, contact, admin) and onboarding flow with I18nProvider wrapper.",
  "frontend/src/components/admin/AdminMessageRenderer.tsx": "Component that parses and renders admin messages with formatted/raw JSON view toggle, field categorization, source badges, and localized labels.",
  "frontend/src/components/admin/MaterialsTab.tsx": "Admin tab displaying materials table with columns for name, category, location, submitter attribution (name and ID), and description with refresh functionality.",
  "frontend/src/components/admin/MessagesTab.tsx": "Admin tab component for viewing and deleting system messages with a table display, refresh functionality, and delete confirmation dialog.",
  "frontend/src/components/admin/WorkersTab.tsx": "Admin tab component that displays a table of registered workers with their skills, service categories, locations, and submitter information.",
  "frontend/src/components/common/Work24Card.tsx": "Reusable card wrapper component with hover effects, shadow transitions, and optional click handling.",
  "frontend/src/components/common/Work24FormField.tsx": "Form field wrapper component that provides consistent label, error message, helper text, and required indicator styling.",
  "frontend/src/components/contact/ContactViaWork24Dialog.tsx": "Dialog form for customers to contact workers through Work24, collecting name, mobile, and requirement details with validation.",
  "frontend/src/components/contact/Work24OfficialContactPanel.tsx": "Dialog displaying official Work24 contact information (phone and email) for direct communication.",
  "frontend/src/components/layout/AppFooter.tsx": "Application footer with contact information, service description, quick links, and attribution to Caffeine.ai.",
  "frontend/src/components/layout/AppHeader.tsx": "Sticky header with logo, desktop/mobile navigation, language switcher, and conditional admin link based on login status.",
  "frontend/src/components/layout/AppShell.tsx": "Main layout wrapper that combines AppHeader, page content, and AppFooter in a flex column structure.",
  "frontend/src/components/materials/MaterialCard.tsx": "Card component displaying material details with image, name, category, description, and contact button with sanitized data.",
  "frontend/src/components/settings/LanguageSwitcher.tsx": "Dropdown menu component for switching between English, Hindi, and Gujarati languages using the i18n system.",
  "frontend/src/components/workers/WorkerCard.tsx": "React component that displays a worker's profile card with image, name, skill, work gallery (up to 3 images in a dialog), and a contact button that sanitizes worker data for safety.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and manages an authenticated or anonymous backend actor using Internet Identity, initializes access control with admin token, and invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context provider and hook for Internet Identity authentication, managing login state, identity persistence, and delegation validity with configurable AuthClient options.",
  "frontend/src/hooks/useQueries.ts": "Custom React Query hooks for fetching admin messages, deleting messages, and retrieving materials and workers data with proper caching and invalidation.",
  "frontend/src/i18n/I18nProvider.tsx": "React context provider for internationalization that manages language state (persisted to local storage), provides translation function, and updates document language attribute.",
  "frontend/src/i18n/translations.ts": "Translation dictionary defining English text for navigation, onboarding, services, materials, career, architect, and admin sections (Hindi and Gujarati translations truncated).",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light/dark themes using an off-white base, orange primary, and green secondary/accent colors.",
  "frontend/src/lib/adminAllowlist.ts": "Deprecated module for principal-based admin allowlist; admin access now uses username/password authentication via adminSession.ts instead.",
  "frontend/src/lib/adminMessageFormatting.ts": "Helper functions for parsing JSON messages, categorizing recognized fields, formatting values for display, and extracting human-readable message sources with i18n support.",
  "frontend/src/lib/adminSession.ts": "Session storage-based admin authentication manager that stores/retrieves admin credentials (adminId, password) for the current browser session.",
  "frontend/src/lib/contactSubmissions.ts": "Defines ContactSubmission interface and useSubmitContact hook that submits contact form data (worker, material, career, architect) to the backend actor and invalidates admin message queries.",
  "frontend/src/lib/formatIcTime.ts": "Exports formatIcTime function that converts IC Time (bigint nanoseconds) to a human-readable localized date string.",
  "frontend/src/lib/localPreferences.ts": "Manages localStorage for onboarding status, user name, language preference, and unique submitter ID with getter/setter functions.",
  "frontend/src/lib/materialsStorage.ts": "Provides localStorage-based functions to get and add materials with auto-generated IDs.",
  "frontend/src/lib/officialContact.ts": "Exports official Work24 contact constants (phone, email) with formatted display strings and links.",
  "frontend/src/lib/safety/noDirectContact.ts": "Defines allowed fields for worker and material data and provides sanitization functions to prevent direct contact information exposure.",
  "frontend/src/lib/servicesCatalog.ts": "Defines Service interface and exports a catalog of services (furniture, painting, plumbing, etc.) with translation keys and icons.",
  "frontend/src/lib/validation.ts": "Provides validation functions for required fields and Indian mobile numbers (10 digits starting with 6-9).",
  "frontend/src/lib/workersStorage.ts": "Provides localStorage-based functions to get, filter by service, and add workers with auto-generated IDs.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query, Internet Identity provider, and renders the App component.",
  "frontend/src/pages/Admin.tsx": "Admin dashboard page with login form (credentials: Bharat1213/Bharat1213) and tabs for managing materials, workers, and messages.",
  "frontend/src/pages/Architect.tsx": "Architect project submission form collecting name, project type, location, budget, message, and file uploads, submitting via useSubmitContact hook.",
  "frontend/src/pages/Career.tsx": "Career application form collecting name, mobile, skills, experience, and message, submitting via useSubmitContact hook.",
  "frontend/src/pages/ContactUs.tsx": "Contact page displaying official Work24 phone, email, and service area information with clickable links.",
  "frontend/src/pages/HomeServices.tsx": "Home page component displaying a hero section with Work24 branding and a grid of service cards that navigate to individual service detail pages when clicked.",
  "frontend/src/pages/Materials.tsx": "Materials listing page that displays a grid of material cards from local storage and includes a contact panel for reaching Work24 officials.",
  "frontend/src/pages/Onboarding.tsx": "Onboarding page that collects user name and language preference, validates input, saves preferences to local storage, and redirects to home page.",
  "frontend/src/pages/SellerMaterialSubmission.tsx": "Form page for sellers to submit materials with name, category, description, location, and images; converts images to base64 and stores in local storage with submitter information.",
  "frontend/src/pages/ServiceDetail.tsx": "Service detail page that displays workers filtered by service category in a grid, with a contact dialog for initiating communication via Work24.",
  "frontend/src/pages/WorkerSubmission.tsx": "Form page for submitting worker profiles with name, skill, service category, location, profile image, and work images; validates minimum 3 work images and stores data in local storage.",
  "frontend/src/types/materials.ts": "TypeScript interface defining the Material type with id, name, category, description, images array, optional location, and optional submitter information.",
  "frontend/src/types/workers.ts": "TypeScript interface defining the Worker type with id, name, skill, service category, profile image, work images array, optional location, and optional submitter information.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting URL parameters from both regular query strings and hash-based routing, with sessionStorage persistence and cleanup capabilities.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration file defining custom color schemes using OKLCH color space, extended theme settings including container, border radius, shadows, accordion animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state metadata for Work24 worker marketplace platform tracking implemented features for worker attribution on materials/services and tab-based admin panel organization, with two pending feature requests."
}