{
  "backend/main.mo": "Main actor defining all data types (Message, Worker, Material, CareerApplication, ArchitectProject, ContactRequest, UserProfile) and CRUD operations with admin authorization checks, including mixins for authorization and blob storage.",
  "backend/migration.mo": "Migration module that transforms old Message records (without personName) to new Message records (with personName field defaulted to empty string).",
  "feature_evidence.json": "Feature evidence report documenting two high-confidence features: verifying admin dashboard data fetching without client-side filtering (REQ-3) and adding error boundaries with network diagnostics (REQ-4).",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend files including routing, i18n, storage, validation, UI components, and admin dashboard functionality with proper backend integration.",
  "frontend/index.css": "Tailwind CSS configuration with OKLCH color system defining light and dark theme variables for Work24 brand colors and admin dashboard styling.",
  "frontend/index.html": "HTML entry point with root div and module script loading main.tsx.",
  "frontend/src/App.tsx": "Root application component with TanStack Router setup defining all routes (home, services, materials, career, architect, submissions, contact, admin) wrapped in I18nProvider with onboarding check.",
  "frontend/src/components/activity/ActivityFeed.tsx": "Activity feed component displaying the 10 most recent messages from backend with error boundaries, loading states, network diagnostics, retry functionality, and empty state handling.",
  "frontend/src/components/activity/ActivityMessageRenderer.tsx": "Message renderer that parses JSON-formatted activity messages, extracts source/origin, generates human-readable summaries for different submission types (career, architect, worker, material, contact), and displays with badges.",
  "frontend/src/components/admin/AdminDashboardLayout.tsx": "Layout component for admin dashboard with responsive sidebar navigation (overview, messages, materials, workers sections), mobile menu sheet, and main content area.",
  "frontend/src/components/admin/AdminMessageRenderer.tsx": "Renders admin messages with JSON parsing, structured field display with categorization (recognized vs. other fields), source badge extraction, and raw JSON toggle view.",
  "frontend/src/components/admin/AdminSummaryCards.tsx": "Displays four summary cards showing total counts for messages, workers, materials, and overall activity with error handling, loading states, and individual refetch buttons.",
  "frontend/src/components/admin/MaterialsTab.tsx": "Admin tab displaying all materials in a table with columns for ID, name, category, location, and description, including refresh functionality.",
  "frontend/src/components/admin/MessagesTab.tsx": "Admin tab for viewing and deleting messages with sorting by timestamp, detailed error diagnostics, network error detection, delete confirmation dialog, and extensive console logging.",
  "frontend/src/components/admin/WorkersTab.tsx": "Admin tab displaying all workers in a table with columns for ID, name, skill, category, and location, including refresh functionality.",
  "frontend/src/components/common/Work24Card.tsx": "Reusable card wrapper component with hover effects, optional click handler, and scale animation on hover.",
  "frontend/src/components/common/Work24FormField.tsx": "Form field wrapper component with label, optional required indicator, error message display, and helper text support.",
  "frontend/src/components/contact/ContactViaWork24Dialog.tsx": "Dialog component for submitting contact requests with form validation for customer name, mobile number, and requirements. Handles submission via mutation hook and displays success/error toasts.",
  "frontend/src/components/contact/Work24OfficialContactPanel.tsx": "Dialog component displaying Work24's official contact information (phone and email) with internationalization support. Shows contact details in a formatted panel with icons.",
  "frontend/src/components/layout/AppFooter.tsx": "Footer component displaying contact information, service description, quick navigation links, copyright notice, and attribution to caffeine.ai. Organized in a three-column grid layout.",
  "frontend/src/components/layout/AppHeader.tsx": "Header component with logo, desktop/mobile navigation menus, language switcher, and conditional admin link. Uses Sheet component for mobile menu and supports navigation to all main routes.",
  "frontend/src/components/layout/AppShell.tsx": "Layout wrapper component that combines AppHeader, main content area, and AppFooter in a flex column layout. Provides consistent page structure across the application.",
  "frontend/src/components/materials/MaterialCard.tsx": "Card component displaying material information including image, name, category, location, and description. Includes a contact button that opens ContactViaWork24Dialog.",
  "frontend/src/components/settings/LanguageSwitcher.tsx": "Dropdown menu component for switching between English, Hindi, and Gujarati languages. Uses Globe icon and displays current language selection with i18n context.",
  "frontend/src/components/workers/WorkerCard.tsx": "Card component displaying worker profile with image, name, skill, location, and work gallery. Includes buttons to view work photos in a dialog and contact via Work24.",
  "frontend/src/hooks/useActor.ts": "React Query hook for managing backend actor instances with Internet Identity authentication. Handles actor creation, authentication state, and invalidates dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context provider and hook for Internet Identity authentication, managing login state, identity storage, and AuthClient lifecycle. Provides login, logout, and status tracking functionality.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating backend data including admin messages, all messages, workers by category, and materials, with automatic refetching and query invalidation on mutations.",
  "frontend/src/i18n/I18nProvider.tsx": "Provides internationalization context and hooks for managing language state (en/hi/gu) and translating keys with fallback to English, persisting language preference to local storage.",
  "frontend/src/i18n/translations.ts": "Defines translation dictionaries for English, Hindi, and Gujarati covering navigation, onboarding, services, forms, and admin UI text keys.",
  "frontend/src/index.css": "Defines Tailwind CSS configuration with custom CSS variables for Work24 brand colors and admin dashboard themes in both light and dark modes using OKLCH color space.",
  "frontend/src/lib/adminAllowlist.ts": "Deprecated module that previously managed admin principal allowlists; now replaced by username/password authentication via adminSession.ts.",
  "frontend/src/lib/adminMessageFormatting.ts": "Provides utilities for safely parsing JSON messages, categorizing recognized fields, formatting values for display, and extracting human-readable message sources.",
  "frontend/src/lib/adminSession.ts": "Manages admin authentication session state in sessionStorage, providing functions to set, get, clear, and check admin login status with credentials.",
  "frontend/src/lib/contactSubmissions.ts": "Exports a React Query mutation hook for submitting contact forms (worker, material, career, architect) as JSON messages to the backend actor.",
  "frontend/src/lib/formatIcTime.ts": "Converts Internet Computer nanosecond timestamps (bigint) to human-readable date strings with locale formatting.",
  "frontend/src/lib/localPreferences.ts": "Manages localStorage for onboarding status, user name, language preference, and unique submitter ID generation and retrieval.",
  "frontend/src/lib/materialsStorage.ts": "Provides functions to get and add materials to localStorage with auto-generated unique IDs.",
  "frontend/src/lib/officialContact.ts": "Exports official Work24 contact phone number and email with formatted display strings and action links.",
  "frontend/src/lib/safety/noDirectContact.ts": "Defines allowed fields for worker and material data and provides sanitization functions to prevent exposure of sensitive contact information.",
  "frontend/src/lib/servicesCatalog.ts": "Defines the service catalog with IDs, translation keys, and icons for furniture, painting, fabrication, plumbing, electrical, and custom services.",
  "frontend/src/lib/validation.ts": "Provides validation functions for required fields and Indian mobile numbers with internationalized error messages.",
  "frontend/src/lib/workersStorage.ts": "Provides localStorage-based CRUD operations for Worker entities, including retrieval by service category and ID generation.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query, Internet Identity provider, and renders the root App component.",
  "frontend/src/pages/Admin.tsx": "Admin authentication and dashboard page with login form, session management, and tabs for overview, messages, materials, and workers.",
  "frontend/src/pages/Architect.tsx": "Form page for architects to submit project details including name, type, location, budget, message, and file uploads.",
  "frontend/src/pages/Career.tsx": "Career application form for workers to submit their name, mobile, skills, experience, and optional message.",
  "frontend/src/pages/ContactUs.tsx": "Static contact information page displaying official phone number, email, service description, and response time.",
  "frontend/src/pages/HomeServices.tsx": "Landing page with hero section and service category grid that navigates to individual service detail pages.",
  "frontend/src/pages/Materials.tsx": "Displays a grid of construction materials for sale fetched from backend using MaterialCard components.",
  "frontend/src/pages/Onboarding.tsx": "First-time user onboarding flow collecting name and language preference, then saving to local storage and redirecting to home.",
  "frontend/src/pages/SellerMaterialSubmission.tsx": "Form page for sellers to submit construction materials for sale, including validation, image upload handling, and mutation to add materials to the backend.",
  "frontend/src/pages/ServiceDetail.tsx": "Service detail page that displays available workers for a specific service category, fetched from the backend using the useGetWorkersByCategory hook.",
  "frontend/src/pages/WorkerSubmission.tsx": "Registration form for workers to submit their profiles with skills, category selection, profile image, and work portfolio images, with validation and backend mutation.",
  "frontend/src/types/materials.ts": "TypeScript interface defining the Material type with properties for id, name, category, description, images, location, and submitter information.",
  "frontend/src/types/workers.ts": "TypeScript interface defining the Worker type with properties for id, name, skill, service category, images, location, and submitter information.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, storing, and managing URL parameters and session storage, supporting both standard and hash-based routing with persistence across navigation.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom theme extensions including color schemes (with admin-specific colors), container settings, border radius, shadows, and animations.",
  "project_state.json": "Project state file tracking a fix request for admin dashboard not showing cross-device activity data, with pending backend debugging and logging feature requests."
}