{
  "backend/main.mo": "Canister storing user profiles and timestamped messages with access control for users and admins.",
  "feature_evidence.json": "Feature evidence report mapping product features to related frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Reference list summarizing many frontend files and their roles across the application.",
  "frontend/index.css": "Global Tailwind base styles defining theme variables for light and dark modes.",
  "frontend/index.html": "HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Sets up TanStack Router routes, onboarding logic, and wraps the app with I18nProvider.",
  "frontend/src/components/common/Work24Card.tsx": "Reusable card component applying consistent styling and optional click behavior.",
  "frontend/src/components/common/Work24FormField.tsx": "Reusable form field wrapper with label, helper text, and error display.",
  "frontend/src/components/contact/ContactViaWork24Dialog.tsx": "Modal dialog for contacting a worker with form validation and backend submission.",
  "frontend/src/components/contact/Work24OfficialContactPanel.tsx": "Dialog showing official Work24 contact phone and email details using translations.",
  "frontend/src/components/layout/AppFooter.tsx": "Renders the site footer with contact info, service text, quick links, and branding using i18n strings.",
  "frontend/src/components/layout/AppHeader.tsx": "Builds a responsive header with navigation, language switching, and optional admin links based on authentication.",
  "frontend/src/components/layout/AppShell.tsx": "Wraps the page with a header, main content area, and footer.",
  "frontend/src/components/materials/MaterialCard.tsx": "Displays a material’s image, details, and a contact button using sanitized data.",
  "frontend/src/components/settings/LanguageSwitcher.tsx": "Provides a dropdown to switch app languages using i18n state.",
  "frontend/src/components/workers/WorkerCard.tsx": "Shows worker info, a work gallery with image dialogs, and a contact button using sanitized worker data.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous backend actor and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Manages Internet Identity auth, exposing identity state, login, logout, and status tracking.",
  "frontend/src/hooks/useQueries.ts": "Fetches admin messages from the backend actor via a react-query hook.",
  "frontend/src/i18n/I18nProvider.tsx": "Provides language state, translation lookup, and persistence for the app.",
  "frontend/src/i18n/translations.ts": "Defines supported languages and translation keys for the app’s UI text.",
  "frontend/src/index.css": "Sets up Tailwind layers and defines light/dark theme CSS variables and base styles.",
  "frontend/src/lib/adminAllowlist.ts": "Provides a frontend-only admin allowlist check and controls admin UI visibility.",
  "frontend/src/lib/contactSubmissions.ts": "Defines contact submission types and a React Query mutation for sending submissions via the actor.",
  "frontend/src/lib/formatIcTime.ts": "Converts bigint nanosecond IC timestamps into readable locale strings.",
  "frontend/src/lib/localPreferences.ts": "Manages onboarding, username, and language preferences in localStorage.",
  "frontend/src/lib/materialsStorage.ts": "Stores and retrieves material items in localStorage and generates IDs for new materials.",
  "frontend/src/lib/officialContact.ts": "Exports official phone and email constants along with formatted link versions.",
  "frontend/src/lib/safety/noDirectContact.ts": "Sanitizes worker and material objects by whitelisting allowed fields.",
  "frontend/src/lib/servicesCatalog.ts": "Defines the service catalog with IDs, translation keys, and icons, with a lookup helper.",
  "frontend/src/lib/validation.ts": "Provides simple validation helpers for required fields and mobile numbers.",
  "frontend/src/lib/workersStorage.ts": "Handles worker storage in localStorage, including filtering and ID generation.",
  "frontend/src/main.tsx": "Renders the app root with Internet Identity and React Query providers.",
  "frontend/src/pages/Admin.tsx": "Admin dashboard page that displays backend‑fetched messages with authentication and error states.",
  "frontend/src/pages/Architect.tsx": "Form page for architect project submissions with validation, file handling, and contact submission.",
  "frontend/src/pages/Career.tsx": "Career application form with validation and submission through the contact handler.",
  "frontend/src/pages/ContactUs.tsx": "Renders a contact page with phone, email, services info, and response-time text using i18n values.",
  "frontend/src/pages/HomeServices.tsx": "Displays a homepage hero section and a grid of service cards linking to service detail pages.",
  "frontend/src/pages/Materials.tsx": "Shows a list of stored materials with contact panel support or an empty-state message.",
  "frontend/src/pages/Onboarding.tsx": "Provides onboarding form to collect name and language, validate input, save preferences, and redirect home.",
  "frontend/src/pages/SellerMaterialSubmission.tsx": "Form for sellers to submit material data with images, validation, base64 conversion, and storage.",
  "frontend/src/pages/ServiceDetail.tsx": "Displays service details and associated workers, allowing opening a contact dialog for a selected worker.",
  "frontend/src/pages/WorkerSubmission.tsx": "Worker profile submission form handling validation, image uploads, base64 conversion, and storage.",
  "frontend/src/types/materials.ts": "Defines the Material interface with id, metadata fields, images, and optional location.",
  "frontend/src/types/workers.ts": "Defines the Worker interface with identity, skills, service category, images, and optional location.",
  "frontend/src/utils/urlParams.ts": "Utility for reading, storing, persisting, and clearing URL/session parameters, including hash routing support.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, radii, shadows, accordion animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Defines the project’s state, including feature lists, admin-page requirements, and metadata for viewing canister‑stored data."
}