{
  "backend/main.mo": "Actor storing timestamped text messages with methods to add and retrieve them.",
  "feature_evidence.json": "Feature evidence report describing addition of Contact Us navigation item and related components.",
  "frontend-file-summaries.txt": "Collection of summarized descriptions for various frontend files and components.",
  "frontend/index.css": "Tailwind base styles defining OKLCH CSS variables for light and dark themes.",
  "frontend/index.html": "HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Main React router setup defining routes including the /contact page with I18nProvider.",
  "frontend/src/components/common/Work24Card.tsx": "Reusable styled card component with optional click interaction.",
  "frontend/src/components/common/Work24FormField.tsx": "Form field wrapper showing label, errors, helper text, and child input.",
  "frontend/src/components/contact/ContactViaWork24Dialog.tsx": "Dialog form for contacting a worker with validation and backend submission.",
  "frontend/src/components/contact/Work24OfficialContactPanel.tsx": "Dialog showing official phone and email contact details.",
  "frontend/src/components/layout/AppFooter.tsx": "Footer with contact info, service description, quick links, and attribution.",
  "frontend/src/components/layout/AppHeader.tsx": "Responsive header with navigation including Contact Us and language switching.",
  "frontend/src/components/layout/AppShell.tsx": "Wraps the app with header, footer, and main layout structure.",
  "frontend/src/components/materials/MaterialCard.tsx": "Displays sanitized material info with image, details, and a contact button.",
  "frontend/src/components/settings/LanguageSwitcher.tsx": "Provides a dropdown to switch app language using i18n context.",
  "frontend/src/components/workers/WorkerCard.tsx": "Shows sanitized worker details, image gallery, and a contact action.",
  "frontend/src/hooks/useActor.ts": "Creates and manages backend actor instances based on Internet Identity state.",
  "frontend/src/hooks/useInternetIdentity.ts": "Manages Internet Identity authentication, login state, and identity persistence.",
  "frontend/src/hooks/useQueries.ts": "Fetches messages from the backend using the current actor.",
  "frontend/src/i18n/I18nProvider.tsx": "Provides language state, translation lookup, and persistence for i18n.",
  "frontend/src/i18n/translations.ts": "Defines translation dictionaries and types for supported languages.",
  "frontend/src/index.css": "Configures Tailwind styles, theme variables, and global typography.",
  "frontend/src/lib/contactSubmissions.ts": "Sends contact submissions to backend via actor and invalidates messages cache.",
  "frontend/src/lib/localPreferences.ts": "Handles onboarding, language, and user preference persistence in localStorage.",
  "frontend/src/lib/materialsStorage.ts": "Manages localStorage-based material retrieval and creation.",
  "frontend/src/lib/officialContact.ts": "Stores official Work24 phone and email constants with formatted links.",
  "frontend/src/lib/safety/noDirectContact.ts": "Sanitizes worker and material objects by whitelisting allowed fields.",
  "frontend/src/lib/servicesCatalog.ts": "Defines the service list and provides lookup by service ID.",
  "frontend/src/lib/validation.ts": "Provides required and mobile number validation helpers returning translated error messages.",
  "frontend/src/lib/workersStorage.ts": "Manages worker data in localStorage, including retrieval, filtering by service, and adding new workers.",
  "frontend/src/main.tsx": "Application entry point that mounts React, sets up React Query, and wraps the app with Internet Identity context.",
  "frontend/src/pages/Architect.tsx": "Implements an architect project submission form with validation, file uploads, and contact submission handling.",
  "frontend/src/pages/Career.tsx": "Implements a career application form with required and mobile validation and submits data via contact submission.",
  "frontend/src/pages/ContactUs.tsx": "Displays official contact details and a services info panel with localized text.",
  "frontend/src/pages/HomeServices.tsx": "Renders the home page hero section and lists available services, allowing navigation to individual service pages.",
  "frontend/src/pages/Materials.tsx": "Shows stored materials and opens a contact panel; loads materials from localStorage.",
  "frontend/src/pages/Onboarding.tsx": "Collects user name and language preference, validates input, saves onboarding state, and redirects home.",
  "frontend/src/pages/SellerMaterialSubmission.tsx": "Provides a form for sellers to submit new materials with validation and image upload converted to base64 for storage.",
  "frontend/src/pages/ServiceDetail.tsx": "Displays a service’s details and lists workers for that service, with a dialog for contacting a selected worker.",
  "frontend/src/pages/WorkerSubmission.tsx": "Implements a worker submission form with validation, image uploads, and adding the worker to storage before redirecting.",
  "frontend/src/types/materials.ts": "Defines the Material interface with fields for metadata and images.",
  "frontend/src/types/workers.ts": "Defines the Worker interface including profile and work image fields.",
  "frontend/tailwind.config.js": "Configures Tailwind CSS theme extensions, colors, animations, and plugins.",
  "project_state.json": "Stores project metadata, feature state, and pending requests for the Contact Us navigation item."
}