{
  "kind": "build_request",
  "title": "Admin dashboard: display all collected user submissions and allow admin deletion",
  "projectName": "Work24 Admin Dashboard",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Update backend message storage so each collected user submission has a stable unique identifier and can be listed by the admin with its id, stored message text, and timestamp (using the existing username/password admin gate: adminId=\"Bharat1213\", password=\"bharatranjan1213\").",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-user-1"
        ],
        "quotes": [
          "all the data collected from user should display here and admin have right to delete the data."
        ]
      },
      "acceptanceCriteria": [
        "Calling the admin list API returns an array of messages where each entry includes (messageId, messageText, timestamp).",
        "Existing username/password check remains required for admin list access and uses the exact credentials already implemented.",
        "Newly added user submissions (via addMessage) appear in the admin list response with unique ids."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Add backend admin APIs to delete collected user submissions by id (and optionally delete all submissions), protected by the same existing admin username/password check.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-user-1"
        ],
        "quotes": [
          "admin have right to delete the data."
        ]
      },
      "acceptanceCriteria": [
        "Deleting a message by id removes it from subsequent admin list results.",
        "Attempting to delete with wrong admin credentials traps/returns an error and does not delete anything.",
        "Deleting a non-existent id returns a clear error (trap) and does not affect other records."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Expand the Admin page (/admin) to display all collected user submissions using the new backend message list (show at minimum timestamp + submission content; keep user-facing text in English).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-user-1"
        ],
        "quotes": [
          "all the data collected from user should display here"
        ]
      },
      "acceptanceCriteria": [
        "After admin login, the Admin dashboard renders a table/list populated from the backend list API (not hardcoded).",
        "If there is no data, the page shows the existing empty state (or an equivalent English empty state).",
        "The Refresh button still refetches and updates the list."
      ]
    },
    {
      "id": "REQ-4",
      "text": "Add delete controls to the Admin dashboard so the admin can delete individual collected submissions from the UI, with a confirmation step, and the UI refreshes after deletion.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-user-1"
        ],
        "quotes": [
          "admin have right to delete the data."
        ]
      },
      "acceptanceCriteria": [
        "Each listed submission row includes a Delete action.",
        "Clicking Delete asks for confirmation (dialog or equivalent).",
        "On successful delete, the deleted submission no longer appears without requiring a full page reload (React Query invalidation/refetch is acceptable).",
        "On error (e.g., unauthorized), the UI shows an English error message and does not remove the row."
      ]
    },
    {
      "id": "REQ-5",
      "text": "Update React Query hooks to support fetching the admin submission list with ids and performing delete mutations using the current admin session stored in sessionStorage.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-user-1"
        ]
      },
      "acceptanceCriteria": [
        "Admin list query keying remains stable and continues to use the admin session as part of the query key.",
        "Delete mutation uses the stored adminId/password from the existing admin session helper and calls the new backend delete API.",
        "After deletion, the admin list query is invalidated/refetched."
      ]
    },
    {
      "id": "REQ-6",
      "text": "Add/adjust i18n English strings used by the Admin dashboard for delete actions and confirmation prompts (do not mention Internet Identity).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-user-1"
        ]
      },
      "acceptanceCriteria": [
        "Admin delete UI strings (e.g., “Delete”, “Cancel”, “Confirm delete”, “Are you sure?”) are available in English and are wired through the existing i18n mechanism.",
        "No admin UI text references Internet Identity."
      ]
    }
  ],
  "constraints": [
    "Keep the admin credentials exactly as currently implemented: adminId=\"Bharat1213\" and password=\"bharatranjan1213\".",
    "Backend must remain a single Motoko actor in backend/main.mo (no additional backend services).",
    "Do not edit files under frontend/src/components/ui or any paths listed as immutable in SYSTEM_CONTEXT.",
    "Do not introduce third-party authentication; admin access remains username/password via sessionStorage."
  ],
  "nonGoals": [
    "Building real-time updates (no WebSockets/streaming).",
    "Adding new kinds of user-facing submission forms beyond what already exists.",
    "Persisting worker/material submissions currently stored in localStorage into the backend (unless separately requested)."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}