{
  "kind": "build_request",
  "title": "Render admin submissions in a human-friendly format (not raw JSON)",
  "projectName": "Work24 Admin Dashboard",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-7",
      "text": "Update the Admin dashboard message table to display collected submission data in a human-friendly, easy-to-read layout instead of showing the raw JSON string in the “Message” column.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "data is in this kind of , make it easy to read and understand.\nnot in this kind of jason?"
        ]
      },
      "acceptanceCriteria": [
        "When a message’s text value is a JSON object string, the Admin page parses it client-side and renders a structured view (labels + values) rather than showing the raw JSON string.",
        "When a message’s text value is not valid JSON, the Admin page continues to display it as plain text (current behavior).",
        "The structured view is readable on mobile and desktop (wraps long text, does not overflow the table cell)."
      ]
    },
    {
      "id": "REQ-8",
      "text": "Add a per-message toggle on the Admin dashboard to switch between “Formatted” view and “Raw JSON” view for messages that can be parsed as JSON.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "not in this kind of jason?"
        ]
      },
      "acceptanceCriteria": [
        "For JSON-parsable messages, the UI includes an explicit control to view the raw JSON text.",
        "Toggling does not affect other rows and does not require a refetch.",
        "Raw JSON is displayed in a monospaced, wrapped block to keep it readable."
      ]
    },
    {
      "id": "REQ-9",
      "text": "In the formatted Admin message view, surface commonly useful fields (when present) as dedicated, clearly labeled rows/sections: type, customerName/name, mobile, requirement/message/details, location, budget, skills, experience, timestamp (if embedded), and image/file counts; render any remaining JSON keys as a generic key/value list.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ]
      },
      "acceptanceCriteria": [
        "If the parsed JSON contains recognized keys, those values are shown with clear labels and sensible formatting (e.g., multi-line text preserved for “requirement/message/details”).",
        "If the parsed JSON contains other keys, they are still visible under an “Other fields” (or equivalent) section as key/value pairs.",
        "If fields are missing, the UI does not show empty labels; it only shows fields that exist in that message."
      ]
    },
    {
      "id": "REQ-10",
      "text": "Add/adjust i18n strings for any new Admin dashboard UI text introduced by the formatted/raw toggle and formatted field labels; ensure English strings are present and used as the default.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "Use English for any user-facing text in the build request."
        ]
      },
      "acceptanceCriteria": [
        "All newly introduced Admin UI labels/buttons (e.g., Formatted, Raw JSON, Other fields) are sourced via the i18n translation function.",
        "English translations exist for all newly introduced keys."
      ]
    }
  ],
  "constraints": [
    "Do not change immutable frontend paths: frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, frontend/src/components/ui (compose only).",
    "Do not change backend APIs or message storage format for this request; formatting must be done client-side on the Admin page.",
    "Keep all user-facing text for new UI elements available in English via i18n."
  ],
  "nonGoals": [
    "Do not implement new backend endpoints or change the Motoko canister schema/state for formatting purposes.",
    "Do not add new authentication mechanisms (only the existing admin username/password session is used).",
    "Do not add real-time updates or websocket-based live feeds."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}