{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Admin messages page (frontend-only)",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Create an Admin page at /admin that lists canister-stored messages (text + human-readable timestamp) with loading/empty states and a manual refresh action.",
      "acceptanceCriteria": [
        "A new page exists at a stable route (e.g., \"/admin\") and renders inside the existing AppShell layout.",
        "The page fetches canister messages using the existing React Query pattern (same data source as useGetMessages / actor.getMessages).",
        "The page renders a readable list/table showing message text and a human-readable timestamp for each record.",
        "The page includes visible loading and empty states (e.g., “Loading…” and “No data found”).",
        "The page includes a manual “Refresh” action that re-fetches the messages (React Query refetch / invalidation)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/Admin.tsx",
          "operation": "create",
          "description": "Create an Admin page UI that renders inside the existing AppShell (via routing) and displays a readable list/table of messages (text + formatted timestamp), including loading, empty, and manual refresh states driven by React Query. Use existing shadcn-ui primitives already present in the repo (e.g., Button/Card/Table where available) to compose the layout; do not modify files under frontend/src/components/ui. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/lib/formatIcTime.ts",
          "operation": "create",
          "description": "Add a small utility to convert IC Time (bigint) to a human-readable timestamp string for the Admin messages list/table."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Use the admin-only backend method for the Admin page data query and provide clear UI feedback for unauthenticated and unauthorized states.",
      "acceptanceCriteria": [
        "The Admin page calls the new admin-only backend query method (not the public getMessages) when an actor is available.",
        "If the backend returns an unauthorized/forbidden error, the UI shows an “Access denied” message in English and does not show any data.",
        "If the user is not logged in (no identity/actor), the Admin page shows an English prompt to sign in using Internet Identity before attempting to load data.",
        "Successful authorized access shows the message list/table without errors."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Add a new React Query hook (e.g., useGetAdminMessages) that uses the existing actor from useActor and calls the admin-only backend capability already available in the frontend types (actor.getAdminMessages). Ensure it supports refetch for the Admin page manual refresh behavior."
        },
        {
          "path": "frontend/src/pages/Admin.tsx",
          "operation": "modify",
          "description": "Wire the Admin page to use the new admin-only React Query hook and gate data loading: show an English Internet Identity sign-in prompt when no identity/actor exists, and show an English “Access denied” state when the admin query fails due to authorization (without rendering any message data)."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Add /admin route and expose an Admin nav link in the header, visible only when authenticated and the user appears admin (frontend allowlist check), without changing immutable hook files.",
      "acceptanceCriteria": [
        "App routing includes the Admin route alongside existing routes (no regression to current routes like /contact).",
        "The header navigation includes an “Admin” entry that navigates to the Admin route.",
        "The “Admin” nav item is conditionally visible only when the user is authenticated and the app can determine admin eligibility (e.g., by comparing the current principal string to a frontend admin allowlist that matches backend configuration).",
        "If the user is not eligible, the “Admin” link does not appear in desktop or mobile navigation."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/Admin.tsx",
          "operation": "create",
          "description": "Create the Admin page component to be routed at /admin (must not be orphaned; will be wired into App routing)."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Register a stable /admin route in the existing TanStack Router tree and wire it to the Admin page component, ensuring existing routes (including /contact) remain unchanged and continue to work."
        },
        {
          "path": "frontend/src/lib/adminAllowlist.ts",
          "operation": "create",
          "description": "Create a small frontend admin allowlist helper that compares the current authenticated principal string to a hardcoded allowlist intended to match the backend configuration, enabling conditional rendering of the Admin navigation item."
        },
        {
          "path": "frontend/src/components/layout/AppHeader.tsx",
          "operation": "modify",
          "description": "Add a conditional “Admin” navigation item (desktop + mobile) that navigates to /admin, visible only when authenticated (Internet Identity identity exists) and the user appears to be an admin via the frontend allowlist helper. Use existing shadcn-ui components already imported (e.g., Button/Sheet) by composing them only; do not modify frontend/src/components/ui. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-5",
      "summary": "Add i18n keys for the Admin page and Admin navigation label using the existing translation structure (English minimum, no missing-key crashes).",
      "acceptanceCriteria": [
        "New translation keys exist for the Admin nav label and Admin page headings/messages.",
        "English strings are provided for all new keys.",
        "If non-English languages are not translated, they fall back to English strings or otherwise do not break rendering (no missing-key crashes)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/i18n/translations.ts",
          "operation": "modify",
          "description": "Add new translation keys for Admin navigation and Admin page UI strings (e.g., nav.admin, admin.title, admin.loading, admin.empty, admin.refresh, admin.accessDenied, admin.signInPrompt). Provide English strings at minimum and ensure other languages either include safe fallbacks or otherwise do not break rendering."
        },
        {
          "path": "frontend/src/components/layout/AppHeader.tsx",
          "operation": "modify",
          "description": "Update the header to use the new i18n key for the “Admin” label (t('nav.admin')) so the navigation text is localized via the existing translation structure."
        },
        {
          "path": "frontend/src/pages/Admin.tsx",
          "operation": "modify",
          "description": "Update the Admin page to use the new i18n keys for headings and status messages (loading/empty/access denied/sign-in prompt/refresh) via the existing I18nProvider context."
        }
      ]
    }
  ]
}