{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Work24 Admin Dashboard — Human-friendly rendering for JSON submissions",
  "requirements": [
    {
      "id": "REQ-7",
      "summary": "Render JSON-shaped admin message payloads as a structured, readable layout instead of raw JSON in the Message column, while preserving plain-text behavior for non-JSON.",
      "acceptanceCriteria": [
        "When a message’s text value is a JSON object string, the Admin page parses it client-side and renders a structured view (labels + values) rather than showing the raw JSON string.",
        "When a message’s text value is not valid JSON, the Admin page continues to display it as plain text (current behavior).",
        "The structured view is readable on mobile and desktop (wraps long text, does not overflow the table cell)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/admin/AdminMessageRenderer.tsx",
          "operation": "create",
          "description": "Create a dedicated renderer for the Admin table “Message” cell that attempts client-side JSON parsing and, when successful, shows a readable structured layout with wrapping and overflow-safe styles; otherwise falls back to plain text. Use shadcn-ui components (e.g., Button) where appropriate. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/Admin.tsx",
          "operation": "modify",
          "description": "Update the Admin messages table to use the new AdminMessageRenderer component in the “Message” column, ensuring the cell remains mobile/desktop friendly (wrap long content; no overflow). Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-8",
      "summary": "Add a per-message toggle to switch between Formatted view and Raw JSON view for JSON-parsable messages without refetching and without affecting other rows.",
      "acceptanceCriteria": [
        "For JSON-parsable messages, the UI includes an explicit control to view the raw JSON text.",
        "Toggling does not affect other rows and does not require a refetch.",
        "Raw JSON is displayed in a monospaced, wrapped block to keep it readable."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/admin/AdminMessageRenderer.tsx",
          "operation": "modify",
          "description": "Add per-row local UI state and a toggle control for JSON-parsable messages to switch between “Formatted” and “Raw JSON”; render raw JSON in a monospaced, wrapped block and keep the toggle isolated to the row. Use shadcn-ui components (e.g., Button) for the toggle. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/Admin.tsx",
          "operation": "modify",
          "description": "Ensure the table cell integration supports the per-row toggle (no shared state across rows; no refetch required when toggling) by passing stable identifiers/props to AdminMessageRenderer. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-9",
      "summary": "In formatted view, highlight common fields with labeled sections and show remaining keys under an “Other fields” list, only rendering fields that exist.",
      "acceptanceCriteria": [
        "If the parsed JSON contains recognized keys, those values are shown with clear labels and sensible formatting (e.g., multi-line text preserved for “requirement/message/details”).",
        "If the parsed JSON contains other keys, they are still visible under an “Other fields” (or equivalent) section as key/value pairs.",
        "If fields are missing, the UI does not show empty labels; it only shows fields that exist in that message."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/admin/AdminMessageRenderer.tsx",
          "operation": "modify",
          "description": "Implement formatted rendering that surfaces common fields when present (type, customerName/name, mobile, requirement/message/details, location, budget, skills, experience, timestamp (if embedded), image/file counts) using clearly labeled rows/sections; preserve multi-line text; render remaining keys under an “Other fields” section as generic key/value pairs; omit missing/empty fields. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/lib/adminMessageFormatting.ts",
          "operation": "create",
          "description": "Add helper functions for Admin message parsing/normalization (safe JSON parse, recognized-key extraction, residual key listing, and simple value formatting such as counts and multi-line text handling) to keep AdminMessageRenderer clean and consistent."
        }
      ]
    },
    {
      "id": "REQ-10",
      "summary": "Add i18n keys for new Admin formatted/raw UI text and field labels with English defaults, and ensure all new labels are sourced via i18n.",
      "acceptanceCriteria": [
        "All newly introduced Admin UI labels/buttons (e.g., Formatted, Raw JSON, Other fields) are sourced via the i18n translation function.",
        "English translations exist for all newly introduced keys."
      ],
      "file_operations": [
        {
          "path": "frontend/src/i18n/translations.ts",
          "operation": "modify",
          "description": "Add new Admin translation keys (English required) for the formatted/raw toggle labels and formatted field labels/section headings (e.g., formatted, rawJson, otherFields, type, name, mobile, requirement, message, details, location, budget, skills, experience, timestamp, imageCount, fileCount)."
        },
        {
          "path": "frontend/src/components/admin/AdminMessageRenderer.tsx",
          "operation": "modify",
          "description": "Replace any new user-facing strings introduced for formatted/raw views and field labels with i18n lookups via the existing translation function (useI18n().t). Verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}