{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Work24 Admin Dashboard: list submissions with ids and allow deletion",
  "requirements": [
    {
      "id": "REQ-3",
      "summary": "Update /admin to render collected submissions from backend list including timestamp and content (and internally use stable ids).",
      "acceptanceCriteria": [
        "After admin login, the Admin dashboard renders a table/list populated from the backend list API (not hardcoded).",
        "If there is no data, the page shows the existing empty state (or an equivalent English empty state).",
        "The Refresh button still refetches and updates the list."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Update the admin messages query to use the backend’s new tuple shape (messageId, messageText, timestamp) and keep the query key stable while still incorporating the current admin session from sessionStorage."
        },
        {
          "path": "frontend/src/pages/Admin.tsx",
          "operation": "modify",
          "description": "Update the admin dashboard table rendering to consume the new message list shape from React Query (use messageId as the row key; display at minimum timestamp + submission content). Use existing shadcn-ui Table/Card/Button components already present; verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Add per-row delete controls with confirmation and post-delete refresh behavior on the Admin dashboard.",
      "acceptanceCriteria": [
        "Each listed submission row includes a Delete action.",
        "Clicking Delete asks for confirmation (dialog or equivalent).",
        "On successful delete, the deleted submission no longer appears without requiring a full page reload (React Query invalidation/refetch is acceptable).",
        "On error (e.g., unauthorized), the UI shows an English error message and does not remove the row."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/Admin.tsx",
          "operation": "modify",
          "description": "Add a Delete action per submission row, including a confirmation step (e.g., confirm dialog or equivalent) and UI states for deleting/errors. Ensure the list updates after deletion via React Query invalidation/refetch. Use existing shadcn-ui Button/Alert/Table components already imported; verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-5",
      "summary": "Extend React Query hooks to fetch admin list with ids and perform delete mutations using the admin session stored in sessionStorage.",
      "acceptanceCriteria": [
        "Admin list query keying remains stable and continues to use the admin session as part of the query key.",
        "Delete mutation uses the stored adminId/password from the existing admin session helper and calls the new backend delete API.",
        "After deletion, the admin list query is invalidated/refetched."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Add a delete mutation hook that reads adminId/password from the existing sessionStorage helper and calls the backend delete capability using the messageId. On success, invalidate/refetch the admin messages query; on error, surface the error to the caller for English UI messaging."
        },
        {
          "path": "frontend/src/pages/Admin.tsx",
          "operation": "modify",
          "description": "Wire the new delete mutation hook into the Delete action, and ensure success triggers list refresh via invalidation/refetch without a full page reload. Use existing shadcn-ui UI primitives already in the file; verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-6",
      "summary": "Add/adjust English i18n strings for delete actions and confirmation prompts used in the Admin dashboard (no Internet Identity references).",
      "acceptanceCriteria": [
        "Admin delete UI strings (e.g., “Delete”, “Cancel”, “Confirm delete”, “Are you sure?”) are available in English and are wired through the existing i18n mechanism.",
        "No admin UI text references Internet Identity."
      ],
      "file_operations": [
        {
          "path": "frontend/src/i18n/translations.ts",
          "operation": "modify",
          "description": "Add new admin translation keys for delete UI (e.g., Delete/Cancel/Confirm delete/Are you sure?/Deleting…/Delete failed) in English and wire them for use by the Admin page. Ensure no strings mention Internet Identity."
        },
        {
          "path": "frontend/src/pages/Admin.tsx",
          "operation": "modify",
          "description": "Replace hardcoded delete-related UI text with the new i18n keys via the existing I18nProvider translation function, ensuring all user-facing delete/confirm/error text is in English (and no Internet Identity references). Use existing shadcn-ui Alert/Button components; verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}