{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Add worker attribution and tab organization to admin panel",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Store worker identity with material submissions for tracking purposes",
      "acceptanceCriteria": [
        "Material submissions include worker name and ID fields",
        "Worker information is persisted with the material data",
        "Backend stores the association between materials and workers"
      ],
      "file_operations": [
        {
          "path": "frontend/src/types/materials.ts",
          "operation": "modify",
          "description": "Extend the Material interface to include submittedBy field containing worker name and ID. Add optional fields to maintain backward compatibility with existing stored materials."
        },
        {
          "path": "frontend/src/pages/SellerMaterialSubmission.tsx",
          "operation": "modify",
          "description": "Update the material submission form to capture and store the worker name and ID when a new material is submitted. Retrieve worker identity from local preferences or prompt if not available, then include it in the material object before saving to storage."
        },
        {
          "path": "frontend/src/lib/materialsStorage.ts",
          "operation": "modify",
          "description": "Update the addMaterial function to accept and persist the new submittedBy field containing worker name and ID with each material entry."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Store worker identity with service/worker profile submissions for attribution tracking",
      "acceptanceCriteria": [
        "Worker profile submissions include submitter identification",
        "Attribution data is stored with each service listing",
        "Backend maintains the link between workers and their postings"
      ],
      "file_operations": [
        {
          "path": "frontend/src/types/workers.ts",
          "operation": "modify",
          "description": "Extend the Worker interface to include submittedBy field containing the submitter's name and ID. Add optional fields to maintain backward compatibility with existing worker profiles."
        },
        {
          "path": "frontend/src/pages/WorkerSubmission.tsx",
          "operation": "modify",
          "description": "Update the worker profile submission form to capture and store the submitter identity when a worker profile is created. Retrieve submitter name and ID from local preferences or prompt if not available, then include it in the worker object before saving to storage."
        },
        {
          "path": "frontend/src/lib/workersStorage.ts",
          "operation": "modify",
          "description": "Update the addWorker function to accept and persist the new submittedBy field containing submitter name and ID with each worker profile entry."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Display worker attribution information for each material in the admin panel",
      "acceptanceCriteria": [
        "Admin panel displays worker name for each material entry",
        "Worker ID is visible in the material details",
        "Attribution information is clearly labeled and easy to identify"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/admin/MaterialsTab.tsx",
          "operation": "create",
          "description": "Create a new component that displays all materials in a table or card layout. Show material name, category, description, and worker attribution (name and ID) for each entry. Include a column or section clearly labeled 'Submitted By' showing the worker name and ID. Handle materials without attribution gracefully by showing 'Unknown' or similar placeholder."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Display worker attribution information for each service posting in the admin panel",
      "acceptanceCriteria": [
        "Admin panel shows who posted each service/worker profile",
        "Worker attribution is displayed alongside service data",
        "Information is formatted consistently with material attribution"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/admin/WorkersTab.tsx",
          "operation": "create",
          "description": "Create a new component that displays all worker profiles in a table or card layout. Show worker name, skill, service category, and submitter attribution (name and ID) for each entry. Include a column or section clearly labeled 'Submitted By' showing the submitter name and ID. Format attribution consistently with MaterialsTab and handle missing attribution gracefully."
        }
      ]
    },
    {
      "id": "REQ-5",
      "summary": "Organize admin panel data into separate tabs for materials, services, and messages",
      "acceptanceCriteria": [
        "Admin panel uses a tabbed interface with at least three tabs",
        "Materials tab shows all material submissions with worker attribution",
        "Services tab shows all worker/service postings with attribution",
        "Messages tab shows contact form submissions and other messages",
        "User can switch between tabs without losing data",
        "Active tab is visually indicated"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/admin/MessagesTab.tsx",
          "operation": "create",
          "description": "Extract the current messages table functionality from Admin.tsx into a dedicated MessagesTab component. Include the existing message display, delete functionality, and refresh capability with source badges and timestamps."
        },
        {
          "path": "frontend/src/pages/Admin.tsx",
          "operation": "modify",
          "description": "Restructure the admin page to use a tabbed interface with three tabs: Materials, Workers/Services, and Messages. Use the shadcn Tabs component to implement the tab navigation. Wire in MaterialsTab, WorkersTab, and MessagesTab components as tab content. Ensure the login form remains as the entry point before showing tabs. Maintain the active tab state and provide clear visual indication of which tab is selected. Preserve the existing admin authentication mechanism (username/password: Bharat1213)."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Add React Query hooks for fetching materials and workers data from localStorage. Create useGetMaterials and useGetWorkers hooks that return the stored data with proper typing including the new submittedBy fields. These hooks should work alongside the existing admin messages hooks."
        }
      ]
    }
  ]
}