{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix admin dashboard activity feed to show all user activities",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Remove ActivityFeed component from HomeServices page so regular users don't see recent activity",
      "acceptanceCriteria": [
        "The ActivityFeed component is no longer rendered on the HomeServices page",
        "Regular users visiting the home page do not see any activity feed"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/HomeServices.tsx",
          "operation": "modify",
          "description": "Remove the ActivityFeed component import and its rendering from the HomeServices page. Keep the hero section and service catalog grid intact."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Update admin dashboard Messages tab to display all activity messages with proper parsing and sorting",
      "acceptanceCriteria": [
        "Admin Messages tab shows all messages from the backend without filtering",
        "Worker registration activities are visible in the admin dashboard",
        "Material listing activities are visible in the admin dashboard",
        "Requirement submission activities are visible in the admin dashboard",
        "Messages are sorted by timestamp in descending order (newest first)",
        "Each message displays its source/origin clearly using AdminMessageRenderer"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/admin/MessagesTab.tsx",
          "operation": "modify",
          "description": "Update the MessagesTab component to call getAllMessages instead of getAdminMessages. Ensure messages are sorted by timestamp in descending order (newest first). Verify that AdminMessageRenderer is used for each message to properly display the source/origin. The component should display all message types including worker registrations, material listings, career applications, architect projects, and contact requests without any filtering."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Update or add a query hook for getAllMessages if not already present. Ensure the hook uses actor.getAllMessages() and includes proper error handling and loading states. This query should fetch all messages without any client-side filtering."
        }
      ]
    }
  ]
}